import disnake

def consoletag():
    return """  ▄████  ▄▄▄       ██▀███    ▄████  ▒█████ ▓██   ██▓ ██▓    ▓█████ 
 ██▒ ▀█▒▒████▄    ▓██ ▒ ██▒ ██▒ ▀█▒▒██▒  ██▒▒██  ██▒▓██▒    ▓█   ▀ 
▒██░▄▄▄░▒██  ▀█▄  ▓██ ░▄█ ▒▒██░▄▄▄░▒██░  ██▒ ▒██ ██░▒██░    ▒███   
░▓█  ██▓░██▄▄▄▄██ ▒██▀▀█▄  ░▓█  ██▓▒██   ██░ ░ ▐██▓░▒██░    ▒▓█  ▄ 
░▒▓███▀▒ ▓█   ▓██▒░██▓ ▒██▒░▒▓███▀▒░ ████▓▒░ ░ ██▒▓░░██████▒░▒████▒
 ░▒   ▒  ▒▒   ▓▒█░░ ▒▓ ░▒▓░ ░▒   ▒ ░ ▒░▒░▒░   ██▒▒▒ ░ ▒░▓  ░░░ ▒░ ░
  ░   ░   ▒   ▒▒ ░  ░▒ ░ ▒░  ░   ░   ░ ▒ ▒░ ▓██ ░▒░ ░ ░ ▒  ░ ░ ░  ░
░ ░   ░   ░   ▒     ░░   ░ ░ ░   ░ ░ ░ ░ ▒  ▒ ▒ ░░    ░ ░      ░   
      ░       ░  ░   ░           ░     ░ ░  ░ ░         ░  ░   ░  ░
                                            ░ ░                    """


# Определяет язык пользователя по роли в профиле. Если роли нет возвращает по умолчанию английский
def lang_detect(rus, eng, member: disnake.Member):

    role_ids = [role.id for role in member.roles]

    if 1371106230831026256 in role_ids:
        return rus
    elif 1371106275370471484 in role_ids:
        return eng
    else:
        return eng


if __name__ == "__main__":
    print("Это модуль Gargoyle, который не предназначен для запуска напрямую.\nПожалуйста, запустите main.py для использования бота.")
    pass